export const About = () => {
    return (
        <div className="about" id="about">
            <div className="about-w">О нас</div>
            <div className="about-text1">
                Лаборатория гостеприимства — уникальный проект студентов
                Президентской Академии факультета гостеприимства, созданный для
                того, чтобы вывести ваше предприятие на новый уровень. Мы
                внедряем самые передовые тренды индустрии, помогая вам не просто
                идти в ногу со временем, а быть лидерами в сфере гостеприимства.
            </div>

            <div className="about-text2">
                Мы не боимся шутить, искать новое и быть не похожими на
                остальных!
            </div>
        </div>
    );
};
